In [1]:
import seaborn as sns
import pandas as pd

# Check for the builtin datasets in Seaborn Library

In [2]:
sns.get_dataset_names()

/Users/Raazia/opt/anaconda3/lib/python3.7/site-packages/seaborn/utils.py:384: UserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("lxml"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 384 of the file /Users/Raazia/opt/anaconda3/lib/python3.7/site-packages/seaborn/utils.py. To get rid of this warning, pass the additional argument 'features="lxml"' to the BeautifulSoup constructor.

  gh_list = BeautifulSoup(http)

['anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [3]:
df=sns.load_dataset('tips')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
df.rename(columns={'sex':'gender'},inplace=True)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   gender      244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [6]:
df.shape

(244, 7)

## Group by day to find out which days had more tips

In [7]:
df1=df.groupby(['day'])
df1

## How many groups did it make?

In [8]:
df1.ngroups

4

In [9]:
df1.head([1])

    total_bill   tip  gender smoker   day    time  size
0        16.99  1.01  Female     No   Sun  Dinner     2
19       20.65  3.35    Male     No   Sat  Dinner     3
77       27.20  4.00    Male     No  Thur   Lunch     4
90       28.97  3.00    Male    Yes   Fri  Dinner     2

In [10]:
df1.head([2])

    total_bill   tip  gender smoker   day    time  size
0        16.99  1.01  Female     No   Sun  Dinner     2
1        10.34  1.66    Male     No   Sun  Dinner     3
19       20.65  3.35    Male     No   Sat  Dinner     3
20       17.92  4.08    Male     No   Sat  Dinner     2
77       27.20  4.00    Male     No  Thur   Lunch     4
78       22.76  3.00    Male     No  Thur   Lunch     2
90       28.97  3.00    Male    Yes   Fri  Dinner     2
91       22.49  3.50    Male     No   Fri  Dinner     2

## Find the average tip per day

In [11]:
df.groupby(['day'])['tip'].mean()

day
Thur    2.771452
Fri     2.734737
Sat     2.993103
Sun     3.255132
Name: tip, dtype: float64

In [12]:
df2=df.groupby(['time'])

In [13]:
df2.ngroups

2

In [14]:
df2.head([1])

    total_bill   tip  gender smoker   day    time  size
0        16.99  1.01  Female     No   Sun  Dinner     2
77       27.20  4.00    Male     No  Thur   Lunch     4

In [15]:
df.groupby(['time'])['total_bill'].mean()

time
Lunch     17.168676
Dinner    20.797159
Name: total_bill, dtype: float64

In [16]:
df.groupby(['gender'])['tip'].mean()

gender
Male      3.089618
Female    2.833448
Name: tip, dtype: float64

In [17]:
df.groupby(['gender'])['tip'].sum()

gender
Male      485.07
Female    246.51
Name: tip, dtype: float64

In [18]:
df3=df.groupby(['gender'])
df3.head([1])

   total_bill   tip  gender smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [19]:
df3.ngroups

2

In [20]:
df3.size()

gender
Male      157
Female     87
dtype: int64

In [21]:
df.groupby(['smoker'])['tip'].mean()

smoker
Yes    3.008710
No     2.991854
Name: tip, dtype: float64

In [22]:
df4=df.groupby(['smoker'])

### Make an Interpretation why is this happening?

In [23]:
df4.size()

smoker
Yes     93
No     151
dtype: int64

In [24]:
df.groupby(['size'])['total_bill'].mean()

size
1     7.242500
2    16.448013
3    23.277632
4    28.613514
5    30.068000
6    34.830000
Name: total_bill, dtype: float64

In [25]:
df.groupby(['gender','smoker'])['tip'].max()

gender  smoker
Male    Yes       10.0
        No         9.0
Female  Yes        6.5
        No         5.2
Name: tip, dtype: float64

In [26]:
df.groupby(['gender','smoker'])['tip'].describe()

               count      mean       std   min  25%   50%     75%   max
gender smoker
Male   Yes      60.0  3.051167  1.500120  1.00  2.0  3.00  3.8200  10.0
       No       97.0  3.113402  1.489559  1.25  2.0  2.74  3.7100   9.0
Female Yes      33.0  2.931515  1.219916  1.00  2.0  2.88  3.5000   6.5
       No       54.0  2.773519  1.128425  1.00  2.0  2.68  3.4375   5.2

In [27]:
df.groupby(['smoker','gender'])['total_bill','tip'].mean()

/Users/Raazia/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

               total_bill       tip
smoker gender
Yes    Male     22.284500  3.051167
       Female   17.977879  2.931515
No     Male     19.791237  3.113402
       Female   18.105185  2.773519

In [28]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [39]:
ntip=df.tip

In [40]:
ntip.mean()

2.9982786885245902

In [41]:
ntip[ntip<df.tip.mean()].count()

123

In [42]:
bill=df.total_bill

In [43]:
bill.mean()

19.785942622950824

In [44]:
bill[bill>bill.mean()].count()

99

In [45]:
df.loc[(df.gender=='Female')]

     total_bill   tip  gender smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
11        35.26  5.00  Female     No   Sun  Dinner     4
14        14.83  3.02  Female     No   Sun  Dinner     2
16        10.33  1.67  Female     No   Sun  Dinner     3
..          ...   ...     ...    ...   ...     ...   ...
226       10.09  2.00  Female    Yes   Fri   Lunch     2
229       22.12  2.88  Female    Yes   Sat  Dinner     2
238       35.83  4.67  Female     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[87 rows x 7 columns]

In [46]:
df.loc[(df.gender=='Female') & (df.day=='Sun')]

     total_bill   tip  gender smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
11        35.26  5.00  Female     No  Sun  Dinner     4
14        14.83  3.02  Female     No  Sun  Dinner     2
16        10.33  1.67  Female     No  Sun  Dinner     3
18        16.97  3.50  Female     No  Sun  Dinner     3
51        10.29  2.60  Female     No  Sun  Dinner     2
52        34.81  5.20  Female     No  Sun  Dinner     4
114       25.71  4.00  Female     No  Sun  Dinner     3
115       17.31  3.50  Female     No  Sun  Dinner     2
155       29.85  5.14  Female     No  Sun  Dinner     5
157       25.00  3.75  Female     No  Sun  Dinner     4
158       13.39  2.61  Female     No  Sun  Dinner     2
162       16.21  2.00  Female     No  Sun  Dinner     3
164       17.51  3.00  Female    Yes  Sun  Dinner     2
178        9.60  4.00  Female    Yes  Sun  Dinner     2
186       20.90  3.50  Female    Yes  Sun  Dinner     3
188       18.15  3.50  Female    Yes  Sun  Dinner     3

In [47]:
df.loc[(df.gender=='Female') & (df.day=='Sun')| (df.time=='Lunch')]

     total_bill   tip  gender smoker  day    time  size
0         16.99  1.01  Female     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
11        35.26  5.00  Female     No  Sun  Dinner     4
14        14.83  3.02  Female     No  Sun  Dinner     2
16        10.33  1.67  Female     No  Sun  Dinner     3
..          ...   ...     ...    ...  ...     ...   ...
222        8.58  1.92    Male    Yes  Fri   Lunch     1
223       15.98  3.00  Female     No  Fri   Lunch     3
224       13.42  1.58    Male    Yes  Fri   Lunch     2
225       16.27  2.50  Female    Yes  Fri   Lunch     2
226       10.09  2.00  Female    Yes  Fri   Lunch     2

[86 rows x 7 columns]

In [48]:
df.iloc[4,1]

3.61

In [49]:
df.iloc[4:10,3]

4    No
5    No
6    No
7    No
8    No
9    No
Name: smoker, dtype: category
Categories (2, object): [Yes, No]

In [50]:
df.iloc[4:10,3:6]

  smoker  day    time
4     No  Sun  Dinner
5     No  Sun  Dinner
6     No  Sun  Dinner
7     No  Sun  Dinner
8     No  Sun  Dinner
9     No  Sun  Dinner

In [51]:
df.iloc[4,3:6]

smoker        No
day          Sun
time      Dinner
Name: 4, dtype: object

In [52]:
slice=df.iloc[4:12,3:6]

In [53]:
slice

   smoker  day    time
4      No  Sun  Dinner
5      No  Sun  Dinner
6      No  Sun  Dinner
7      No  Sun  Dinner
8      No  Sun  Dinner
9      No  Sun  Dinner
10     No  Sun  Dinner
11     No  Sun  Dinner